In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [4]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [5]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [6]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [7]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [8]:
df.dropna(axis=0)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [9]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [12]:
df.dropna(subset=['born','toy'])

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [13]:
df.dropna(how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25